posts/2023-02-12-taming-the-time:-how-we've-used-xtdb.org
#+title: Taming the Time: how to install & develop with XTDB
#+date: <2023-03-31 12:40>
#+filetags: :bitemporality:databases:elixir:xtdb:clojure:

/The article was originally posted on [[https://dev.to/marleyspoon/taming-the-time-how-to-install-develop-with-xtdb-2lbf][MarleySpoon Dev Blog]]

In the [[https://dev.to/marleyspoon/bitemporality-or-how-to-change-the-past-3k4f][previous article]], we discussed the concept of bitemporality and how it can be used to solve complex architectural problems.
At MarleySpoon, we've used XTDB (or 'XT' for short) for our new order management system /(OMS)/, and discovered a lot of interesting insights about the database itself, the concept of bitemporality, and how developing a project using an immutable, bitemporal database could look like.

In this article, we will be focusing primarily on our development experience (installing, testing with XTDB) from an Elixir application, and we cover more details about deploying, running XT in cluster, and tuning in production in the upcoming article.

* What is XTDB
[[https://xtdb.com/][XTDB]], or Cross-Time Database, is a distributed and transactional database system designed to handle complex and changing data with ease.
It is based on a bitemporal model, which allows for the tracking of both the valid time and transaction time of data, enabling powerful and flexible querying capabilities.
With XTDB, developers can work with immutable data structures, which simplifies development and improves reliability.
Its graph query language, Datalog, provides a powerful and expressive way to navigate relationships within the data.

As we've illustrated before, XT has a lot of benefits:
- Bitemporal
- Supports retroactive corrections
- Document and graph-based
- Flexible data schema
- Unbundled (can be deployed on top of a lot of other DBs and persistence solutions)
- Can be used within JVM or through REST API

As one can see, XT is quite different from most of the widely used SQL and NoSQL databases - and while it provides great benefits for dealing with immutable data and retroactive corrections, it also requires an understanding of some of its implementation principles.

* How we planned to use XTDB
At MarleySpoon, we ship boxes with recipes and ingredients to our customers. The *orders* and our subscription model are the backbone of the whole bussiness logic and that is also reflected in how we build our software.

The core of the orders system is the orders state machine, and although the states are essentially simple, there might still be cases where we could have discrepancies - and in such cases, we would like to have more options to debug or restore orders to a previous state, as well as /retroactively/ correct their data and push the change to dependent subsystems.

The shift from the legacy monolith architecture to service-oriented architecture coupled with the introduction of new OMS also required us to be more careful when it comes to eventual consistency - the *transaction* and *valid* times can be different in the resulting systems so we can't just work around it by using the persistence stack we've used to (e.g. relational DBs with updates in place).

Initially, we considered adding transaction and valid time columns to PostgreSQL to implement bitemporality, as this seemed like a straightforward solution. However, upon further analysis, we realized that this approach would introduce significant complexity to the system design. In particular, any foreign keys would need to take the bitemporal columns into account, meaning that queries would need to consider both the entity relationship and its temporal context. This would require significant changes to the database schema, query design, and application code, and would likely lead to a higher risk of errors and data inconsistencies.

We also considered event sourcing for our needs, but it would add significant incidental complexity, requiring changes to other services' architectures and a significant amount of application-level code changes to ensure that all events were captured and persisted correctly.

After considering various approaches to implementing bitemporality in our system, we decided to give XTDB a try due to its native support for bitemporality and graph database capabilities. We designed our data model around XTDB's capabilities and incorporated the database into our Elixir application.

* Installing XTDB
There are multiple ways to install and use XTDB:
- Use it as a JVM dependency by simply adding it to your JVM project
  #+begin_src clojure
    ; deps.edn
    com.xtdb/xtdb-core {:mvn/version "1.21.0"}
  #+end_src
- Using a pre-built XTDB JAR on a local machine
- Through a [[https://hub.docker.com/r/juxt/xtdb-in-memory][Docker image]]

XTDB is developed in the Clojure programming language and it is very convenient to run it from any Clojure program - so we've decided to write a simple app in Clojure that would run XTDB for us and provide all required setup.

