blog/2023-02-12-taming-the-time:-how-we've-used-xtdb.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://neiro.io/rss.xml"
      title="RSS feed for https://neiro.io/">
<title>Taming the Time: how to install & develop with XTDB</title>
<meta name="author" content="Aleksei Kuznetsov">
    <meta name="referrer" content="no-referrer">
    <link href= "https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.1/normalize.min.css" rel="stylesheet" type="text/css" />
    <link href= "static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico">
    <link rel="canonical" href="https://dev.to/marleyspoon/taming-the-time-how-to-install-develop-with-xtdb-2lbf"></head>
<body>
<div id="preamble" class="status"><div class="header">
    <a href="https://neiro.io">Neiro - Functional programming, software architecture</a>
  </div></div>
<div id="content">
<div class="post-date">31 Mar 2023</div><h1 class="post-title"><a href="https://neiro.io/2023-02-12-taming-the-time:-how-we've-used-xtdb.html">Taming the Time: how to install & develop with XTDB</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3843391">1. What is XTDB</a></li>
<li><a href="#org7c0df15">2. How we planned to use XTDB</a></li>
<li><a href="#orgd089519">3. Installing XTDB</a>
<ul>
<li><a href="#org983fde4">3.1. Installing dependencies</a></li>
<li><a href="#org28de186">3.2. Application entry point &amp; configuration</a></li>
</ul>
</li>
<li><a href="#orgd77d3b0">4. Running XT on a local machine</a>
<ul>
<li><a href="#org33712ca">4.1. Connecting from REPL</a></li>
<li><a href="#org457f711">4.2. Connecting to a remote node</a></li>
</ul>
</li>
<li><a href="#orgc915c05">5. REST API</a>
<ul>
<li><a href="#orgf73d054">5.1. API formats</a></li>
<li><a href="#orgdf8f440">5.2. Main endpoints</a></li>
</ul>
</li>
<li><a href="#org97b0674">6. Elixir HTTP client</a>
<ul>
<li>
<ul>
<li><a href="#org82530aa">6.0.1. Umbrella application</a></li>
<li><a href="#orgfdc815a">6.0.2. HTTP2</a></li>
<li><a href="#orgde9ab45">6.0.3. Telemetry &amp; OpenTelemetry</a></li>
<li><a href="#orgf455515">6.0.4. Encoding EDN</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org15ec514">7. Testing XTDB</a></li>
<li><a href="#orga239462">8. What&rsquo;s next?</a></li>
</ul>
</div>
</nav>
<p>
The article was originally posted on <a href="https://dev.to/marleyspoon/taming-the-time-how-to-install-develop-with-xtdb-2lbf">MarleySpoon Dev Blog</a>
</p>

<p>
In the <a href="https://dev.to/marleyspoon/bitemporality-or-how-to-change-the-past-3k4f">previous article</a>, we discussed the concept of bitemporality and how it can be used to solve complex architectural problems.
At MarleySpoon, we&rsquo;ve used XTDB (or &rsquo;XT&rsquo; for short) for our new order management system <i>(OMS)</i>, and discovered a lot of interesting insights about the database itself, the concept of bitemporality, and how developing a project using an immutable, bitemporal database could look like.
</p>

<p>
In this article, we will be focusing primarily on our development experience (installing, testing with XTDB) from an Elixir application, and we cover more details about deploying, running XT in cluster, and tuning in production in the upcoming article.
</p>

<div id="outline-container-org3843391" class="outline-2">
<h2 id="org3843391"><span class="section-number-2">1.</span> What is XTDB</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://xtdb.com/">XTDB</a>, or Cross-Time Database, is a distributed and transactional database system designed to handle complex and changing data with ease.
It is based on a bitemporal model, which allows for the tracking of both the valid time and transaction time of data, enabling powerful and flexible querying capabilities.
With XTDB, developers can work with immutable data structures, which simplifies development and improves reliability.
Its graph query language, Datalog, provides a powerful and expressive way to navigate relationships within the data.
</p>

<p>
As we&rsquo;ve illustrated before, XT has a lot of benefits:
</p>
<ul class="org-ul">
<li>Bitemporal</li>
<li>Supports retroactive corrections</li>
<li>Document and graph-based</li>
<li>Flexible data schema</li>
<li>Unbundled (can be deployed on top of a lot of other DBs and persistence solutions)</li>
<li>Can be used within JVM or through REST API</li>
</ul>

<p>
As one can see, XT is quite different from most of the widely used SQL and NoSQL databases - and while it provides great benefits for dealing with immutable data and retroactive corrections, it also requires an understanding of some of its implementation principles.
</p>
</div>
</div>

<div id="outline-container-org7c0df15" class="outline-2">
<h2 id="org7c0df15"><span class="section-number-2">2.</span> How we planned to use XTDB</h2>
<div class="outline-text-2" id="text-2">
<p>
At MarleySpoon, we ship boxes with recipes and ingredients to our customers. The <b>orders</b> and our subscription model are the backbone of the whole bussiness logic and that is also reflected in how we build our software.
</p>

<p>
The core of the orders system is the orders state machine, and although the states are essentially simple, there might still be cases where we could have discrepancies - and in such cases, we would like to have more options to debug or restore orders to a previous state, as well as <i>retroactively</i> correct their data and push the change to dependent subsystems.
</p>

<p>
The shift from the legacy monolith architecture to service-oriented architecture coupled with the introduction of new OMS also required us to be more careful when it comes to eventual consistency - the <b>transaction</b> and <b>valid</b> times can be different in the resulting systems so we can&rsquo;t just work around it by using the persistence stack we&rsquo;ve used to (e.g. relational DBs with updates in place).
</p>

<p>
Initially, we considered adding transaction and valid time columns to PostgreSQL to implement bitemporality, as this seemed like a straightforward solution. However, upon further analysis, we realized that this approach would introduce significant complexity to the system design. In particular, any foreign keys would need to take the bitemporal columns into account, meaning that queries would need to consider both the entity relationship and its temporal context. This would require significant changes to the database schema, query design, and application code, and would likely lead to a higher risk of errors and data inconsistencies.
</p>

<p>
We also considered event sourcing for our needs, but it would add significant incidental complexity, requiring changes to other services&rsquo; architectures and a significant amount of application-level code changes to ensure that all events were captured and persisted correctly.
</p>

<p>
After considering various approaches to implementing bitemporality in our system, we decided to give XTDB a try due to its native support for bitemporality and graph database capabilities. We designed our data model around XTDB&rsquo;s capabilities and incorporated the database into our Elixir application.
</p>
</div>
</div>

<div id="outline-container-orgd089519" class="outline-2">
<h2 id="orgd089519"><span class="section-number-2">3.</span> Installing XTDB</h2>
<div class="outline-text-2" id="text-3">
<p>
There are multiple ways to install and use XTDB:
</p>
<ul class="org-ul">
<li><p>
Use it as a JVM dependency by simply adding it to your JVM project
</p>
<div class="org-src-container">
<pre class="src src-clojure">    <span style="color: #8e908c;">; deps.edn</span>
    <span style="color: #bb9200;">com.xtdb</span>/xtdb-core <span style="color: #8959a8;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">mvn</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">version</span> <span style="color: #718c00;">"1.21.0"</span><span style="color: #8959a8;">}</span>
</pre>
</div></li>
<li>Using a pre-built XTDB JAR on a local machine</li>
<li>Through a <a href="https://hub.docker.com/r/juxt/xtdb-in-memory">Docker image</a></li>
</ul>

<p>
XTDB is developed in the Clojure programming language and it is very convenient to run it from any Clojure program - so we&rsquo;ve decided to write a simple app in Clojure that would run XTDB for us and provide all required setup.
</p>
</div>
