posts/2023-02-12-taming-the-time:-how-we've-used-xtdb.org
** Installing dependencies
We've installed Clojure using _asdf_ version manager as it's very convenient to pin JVM and Clojure versions:
#+begin_src bash
# .tool-versions
openjdk-18
clojure 1.11.0.1100
#+end_src

The next step was creating a new Clojure app using [[https://clojure.org/guides/deps_and_cli][deps CLI]] - all of the necessary dependencies were provided in a single file /(deps.edn)/.
XTDB is very modular so we have to install PostgreSQL support, HTTP client and server, metrics, and other tools as separate packages:

#+begin_src clojure
;; deps.edn
{:paths ["src"]
 :deps {org.clojure/clojure {:mvn/version "1.11.0"}
        com.xtdb/xtdb-core {:mvn/version "1.21.0"}
        ;; Persistence
        org.postgresql/postgresql {:mvn/version "42.2.18"}
        com.xtdb/xtdb-jdbc {:mvn/version "1.21.0"}
        com.xtdb/xtdb-rocksdb {:mvn/version "1.21.0"}
        ;; HTTP Client
        com.xtdb/xtdb-http-client {:mvn/version "1.21.0"}
        ;; HTTP Server
        com.xtdb/xtdb-http-server {:mvn/version "1.21.0"}}
}
#+end_src

