blog/2023-02-12-taming-the-time:-how-we've-used-xtdb.html

<div id="outline-container-org983fde4" class="outline-3">
<h3 id="org983fde4"><span class="section-number-3">3.1.</span> Installing dependencies</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We&rsquo;ve installed Clojure using <span class="underline">asdf</span> version manager as it&rsquo;s very convenient to pin JVM and Clojure versions:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8e908c;"># </span><span style="color: #8e908c;">.tool-versions</span>
openjdk-18
clojure 1.11.0.1100
</pre>
</div>

<p>
The next step was creating a new Clojure app using <a href="https://clojure.org/guides/deps_and_cli">deps CLI</a> - all of the necessary dependencies were provided in a single file <i>(deps.edn)</i>.
XTDB is very modular so we have to install PostgreSQL support, HTTP client and server, metrics, and other tools as separate packages:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8e908c;">;; </span><span style="color: #8e908c;">deps.edn</span>
<span style="color: #8959a8;">{</span><span style="color: #f5871f;">:paths</span> <span style="color: #4271ae;">[</span><span style="color: #718c00;">"src"</span><span style="color: #4271ae;">]</span>
 <span style="color: #f5871f;">:deps</span> <span style="color: #4271ae;">{</span><span style="color: #bb9200;">org.clojure</span>/clojure <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">mvn</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">version</span> <span style="color: #718c00;">"1.11.0"</span><span style="color: #718c00;">}</span>
        <span style="color: #bb9200;">com.xtdb</span>/xtdb-core <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">mvn</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">version</span> <span style="color: #718c00;">"1.21.0"</span><span style="color: #718c00;">}</span>
        <span style="color: #8e908c;">;; </span><span style="color: #8e908c;">Persistence</span>
        <span style="color: #bb9200;">org.postgresql</span>/postgresql <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">mvn</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">version</span> <span style="color: #718c00;">"42.2.18"</span><span style="color: #718c00;">}</span>
        <span style="color: #bb9200;">com.xtdb</span>/xtdb-jdbc <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">mvn</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">version</span> <span style="color: #718c00;">"1.21.0"</span><span style="color: #718c00;">}</span>
        <span style="color: #bb9200;">com.xtdb</span>/xtdb-rocksdb <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">mvn</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">version</span> <span style="color: #718c00;">"1.21.0"</span><span style="color: #718c00;">}</span>
        <span style="color: #8e908c;">;; </span><span style="color: #8e908c;">HTTP Client</span>
        <span style="color: #bb9200;">com.xtdb</span>/xtdb-http-client <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">mvn</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">version</span> <span style="color: #718c00;">"1.21.0"</span><span style="color: #718c00;">}</span>
        <span style="color: #8e908c;">;; </span><span style="color: #8e908c;">HTTP Server</span>
        <span style="color: #bb9200;">com.xtdb</span>/xtdb-http-server <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">mvn</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">version</span> <span style="color: #718c00;">"1.21.0"</span><span style="color: #718c00;">}</span><span style="color: #4271ae;">}</span>
<span style="color: #8959a8;">}</span>
</pre>
</div>
</div>
</div>
