posts/2023-02-12-taming-the-time:-how-we've-used-xtdb.org
** Application entry point & configuration
One of the primary reasons we developed a wrapper for XTDB was to enable us to run an XTDB cluster in a Kubernetes environment. We wanted to simplify the setup process by allowing configuration through environment variables, rather than relying on external configuration files. This allowed us to easily manage XTDB's configuration within Kubernetes and provided us with greater flexibility in managing our XTDB cluster.

We've created a _xtdb.clj_ file that is the entry point to the database wrapper and which also has all the required configuration there:

#+begin_src clojure
(def db-spec
  {:host (System/getenv "POSTGRES_HOST")
   :port (System/getenv "POSTGRES_PORT")
   :dbname (System/getenv "POSTGRES_DB")
   :user (System/getenv "POSTGRES_USER")
   :password (System/getenv "POSTGRES_PASSWORD")})

(def config
  {:xtdb.http-server/server {:port 3000
                             :jwks (System/getenv "XTDB_JWKS")} ; auth
   :xtdb.rocksdb/block-cache {:xtdb/module 'xtdb.rocksdb/->lru-block-cache
                              :cache-size (* 1024 1024 1024)} ; RocksDB cache size
   :xtdb/index-store {:kv-store {:xtdb/module 'xtdb.rocksdb/->kv-store
                                 :db-dir "/tmp/xtdb/indexes"
                                 :checkpointer checkpoint-config
                                 :block-cache :xtdb.rocksdb/block-cache
                                 :metrics {:xtdb/module 'xtdb.rocksdb.metrics/->metrics}}}
   :xtdb.jdbc/connection-pool {:dialect {:xtdb/module 'xtdb.jdbc.psql/->dialect}
                               :pool-opts {:maximumPoolSize 10}
                               :db-spec db-spec}
   :xtdb/tx-log {:xtdb/module 'xtdb.jdbc/->tx-log
                 :connection-pool :xtdb.jdbc/connection-pool}
   :xtdb/document-store {:xtdb/module 'xtdb.jdbc/->document-store
                         :connection-pool :xtdb.jdbc/connection-pool}})
#+end_src

Once the initial configuration is done we can provide a simple entry point function that will start an XT node:

#+begin_src clojure
;; XT node - hydrated on start
(def xt-node (atom nil))

(defn -main
  "Starts a new XTDB node"
  []
  (let [node (xtdb/start-node config)]
    (log/info "Started a new XT node ...")
    (seed/seed node) ; seed data that we need on start
    (xtdb/sync node)
    (log/info "Loaded data into a new XT node")
    (reset! @xt-node node) ; set xt-node with the started node
    node))

;; Can be used to run REPL or local XT instance
;;
;; As running it from CLI can assume passing some command line arguments
;; we should accept a list of optional arguments as a function param
(defn start
  [&args]
  ;; Runs -main function to start a new XT node
  (-main))
#+end_src

* Running XT on a local machine
Once our XT app is installed and configured, we can run `clj -X xtdb.core/start` in order to start it on a local machine.
This will enable web UI and REST API on _http://localhost:3000_.

