blog/2023-02-12-taming-the-time:-how-we've-used-xtdb.html

<div id="outline-container-org28de186" class="outline-3">
<h3 id="org28de186"><span class="section-number-3">3.2.</span> Application entry point &amp; configuration</h3>
<div class="outline-text-3" id="text-3-2">
<p>
One of the primary reasons we developed a wrapper for XTDB was to enable us to run an XTDB cluster in a Kubernetes environment. We wanted to simplify the setup process by allowing configuration through environment variables, rather than relying on external configuration files. This allowed us to easily manage XTDB&rsquo;s configuration within Kubernetes and provided us with greater flexibility in managing our XTDB cluster.
</p>

<p>
We&rsquo;ve created a <span class="underline">xtdb.clj</span> file that is the entry point to the database wrapper and which also has all the required configuration there:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8959a8;">(</span><span style="color: #8959a8;">def</span> <span style="color: #c82829;">db-spec</span>
  <span style="color: #4271ae;">{</span><span style="color: #f5871f;">:host</span> <span style="color: #718c00;">(</span><span style="color: #bb9200;">System</span>/getenv <span style="color: #718c00;">"POSTGRES_HOST"</span><span style="color: #718c00;">)</span>
   <span style="color: #f5871f;">:port</span> <span style="color: #718c00;">(</span><span style="color: #bb9200;">System</span>/getenv <span style="color: #718c00;">"POSTGRES_PORT"</span><span style="color: #718c00;">)</span>
   <span style="color: #f5871f;">:dbname</span> <span style="color: #718c00;">(</span><span style="color: #bb9200;">System</span>/getenv <span style="color: #718c00;">"POSTGRES_DB"</span><span style="color: #718c00;">)</span>
   <span style="color: #f5871f;">:user</span> <span style="color: #718c00;">(</span><span style="color: #bb9200;">System</span>/getenv <span style="color: #718c00;">"POSTGRES_USER"</span><span style="color: #718c00;">)</span>
   <span style="color: #f5871f;">:password</span> <span style="color: #718c00;">(</span><span style="color: #bb9200;">System</span>/getenv <span style="color: #718c00;">"POSTGRES_PASSWORD"</span><span style="color: #718c00;">)</span><span style="color: #4271ae;">}</span><span style="color: #8959a8;">)</span>

<span style="color: #8959a8;">(</span><span style="color: #8959a8;">def</span> <span style="color: #c82829;">config</span>
  <span style="color: #4271ae;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb.http-server</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">server</span> <span style="color: #718c00;">{</span><span style="color: #f5871f;">:port</span> <span style="color: #f5871f; font-weight: bold;">3000</span>
                             <span style="color: #f5871f;">:jwks</span> <span style="color: #c678dd;">(</span><span style="color: #bb9200;">System</span>/getenv <span style="color: #718c00;">"XTDB_JWKS"</span><span style="color: #c678dd;">)</span><span style="color: #718c00;">}</span> <span style="color: #8e908c;">; auth</span>
   <span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb.rocksdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">block-cache</span> <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">module</span> '<span style="color: #bb9200;">xtdb.rocksdb</span>/-&gt;lru-block-cache
                              <span style="color: #f5871f;">:cache-size</span> <span style="color: #c678dd;">(</span>* <span style="color: #f5871f; font-weight: bold;">1024</span> <span style="color: #f5871f; font-weight: bold;">1024</span> <span style="color: #f5871f; font-weight: bold;">1024</span><span style="color: #c678dd;">)</span><span style="color: #718c00;">}</span> <span style="color: #8e908c;">; RocksDB cache size</span>
   <span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">index-store</span> <span style="color: #718c00;">{</span><span style="color: #f5871f;">:kv-store</span> <span style="color: #c678dd;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">module</span> '<span style="color: #bb9200;">xtdb.rocksdb</span>/-&gt;kv-store
                                 <span style="color: #f5871f;">:db-dir</span> <span style="color: #718c00;">"/tmp/xtdb/indexes"</span>
                                 <span style="color: #f5871f;">:checkpointer</span> checkpoint-config
                                 <span style="color: #f5871f;">:block-cache</span> <span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb.rocksdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">block-cache</span>
                                 <span style="color: #f5871f;">:metrics</span> <span style="color: #8959a8;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">module</span> '<span style="color: #bb9200;">xtdb.rocksdb.metrics</span>/-&gt;metrics<span style="color: #8959a8;">}</span><span style="color: #c678dd;">}</span><span style="color: #718c00;">}</span>
   <span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb.jdbc</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">connection-pool</span> <span style="color: #718c00;">{</span><span style="color: #f5871f;">:dialect</span> <span style="color: #c678dd;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">module</span> '<span style="color: #bb9200;">xtdb.jdbc.psql</span>/-&gt;dialect<span style="color: #c678dd;">}</span>
                               <span style="color: #f5871f;">:pool-opts</span> <span style="color: #c678dd;">{</span><span style="color: #f5871f;">:maximumPoolSize</span> <span style="color: #f5871f; font-weight: bold;">10</span><span style="color: #c678dd;">}</span>
                               <span style="color: #f5871f;">:db-spec</span> db-spec<span style="color: #718c00;">}</span>
   <span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">tx-log</span> <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">module</span> '<span style="color: #bb9200;">xtdb.jdbc</span>/-&gt;tx-log
                 <span style="color: #f5871f;">:connection-pool</span> <span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb.jdbc</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">connection-pool</span><span style="color: #718c00;">}</span>
   <span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">document-store</span> <span style="color: #718c00;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">module</span> '<span style="color: #bb9200;">xtdb.jdbc</span>/-&gt;document-store
                         <span style="color: #f5871f;">:connection-pool</span> <span style="color: #f5871f;">:</span><span style="color: #bb9200;">xtdb.jdbc</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">connection-pool</span><span style="color: #718c00;">}</span><span style="color: #4271ae;">}</span><span style="color: #8959a8;">)</span>
</pre>
</div>

<p>
Once the initial configuration is done we can provide a simple entry point function that will start an XT node:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8e908c;">;; </span><span style="color: #8e908c;">XT node - hydrated on start</span>
<span style="color: #8959a8;">(</span><span style="color: #8959a8;">def</span> <span style="color: #c82829;">xt-node</span> <span style="color: #4271ae;">(</span>atom <span style="color: #f5871f;">nil</span><span style="color: #4271ae;">)</span><span style="color: #8959a8;">)</span>

<span style="color: #8959a8;">(</span><span style="color: #8959a8;">defn</span> <span style="color: #4271ae;">-main</span>
  <span style="color: #8e908c; font-style: italic;">"Starts a new XTDB node"</span>
  <span style="color: #4271ae;">[]</span>
  <span style="color: #4271ae;">(</span><span style="color: #8959a8;">let</span> <span style="color: #718c00;">[</span>node <span style="color: #c678dd;">(</span><span style="color: #bb9200;">xtdb</span>/start-node config<span style="color: #c678dd;">)</span><span style="color: #718c00;">]</span>
    <span style="color: #718c00;">(</span><span style="color: #bb9200;">log</span>/info <span style="color: #718c00;">"Started a new XT node ..."</span><span style="color: #718c00;">)</span>
    <span style="color: #718c00;">(</span><span style="color: #bb9200;">seed</span>/seed node<span style="color: #718c00;">)</span> <span style="color: #8e908c;">; seed data that we need on start</span>
    <span style="color: #718c00;">(</span><span style="color: #bb9200;">xtdb</span>/sync node<span style="color: #718c00;">)</span>
    <span style="color: #718c00;">(</span><span style="color: #bb9200;">log</span>/info <span style="color: #718c00;">"Loaded data into a new XT node"</span><span style="color: #718c00;">)</span>
    <span style="color: #718c00;">(</span>reset! @xt-node node<span style="color: #718c00;">)</span> <span style="color: #8e908c;">; set xt-node with the started node</span>
    node<span style="color: #4271ae;">)</span><span style="color: #8959a8;">)</span>

<span style="color: #8e908c;">;; </span><span style="color: #8e908c;">Can be used to run REPL or local XT instance</span>
<span style="color: #8e908c;">;;</span>
<span style="color: #8e908c;">;; </span><span style="color: #8e908c;">As running it from CLI can assume passing some command line arguments</span>
<span style="color: #8e908c;">;; </span><span style="color: #8e908c;">we should accept a list of optional arguments as a function param</span>
<span style="color: #8959a8;">(</span><span style="color: #8959a8;">defn</span> <span style="color: #4271ae;">start</span>
  <span style="color: #4271ae;">[</span>&amp;args<span style="color: #4271ae;">]</span>
  <span style="color: #8e908c;">;; </span><span style="color: #8e908c;">Runs -main function to start a new XT node</span>
  <span style="color: #4271ae;">(</span>-main<span style="color: #4271ae;">)</span><span style="color: #8959a8;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd77d3b0" class="outline-2">
<h2 id="orgd77d3b0"><span class="section-number-2">4.</span> Running XT on a local machine</h2>
<div class="outline-text-2" id="text-4">
<p>
Once our XT app is installed and configured, we can run `clj -X xtdb.core/start` in order to start it on a local machine.
This will enable web UI and REST API on <span class="underline"><a href="http://localhost:3000">http://localhost:3000</a></span>.
</p>
</div>
