posts/2023-02-12-taming-the-time:-how-we've-used-xtdb.org
** Connecting from REPL
To run XT in REPL we can instead just execute _clj_ in shell, given that we are in the root directory of the Clojure project.

That will start a new Clojure REPL, and if we want to start XT from there, it's sufficient to use functions we've implemented beforehand:

#+begin_src clojure
(in-ns 'xtdb.core) ; switches current namespace to XT wrapper's core namespace
(-main)
#+end_src

** Connecting to a remote node
Another important benefit of XT that we unfortunately didn't explore enough is that by using the _http-client_ dependency, we're able to connect to any remote node that is accessible to us by HTTP:

#+begin_src clojure
(def remote-node (xt/new-api-client remote-url))
(xt/submit-tx remote-node [[::xt/put {:xt/id :foo :bar :bar}]]) ; submits a transaction on the remote node
#+end_src

Thus, we can connect from REPL to any production XT instance and run queries / submit transactions there.
* REST API
XT is very convenient to use from any Clojure or JVM-based application, however, for clients implemented in other programming languages or different virtual machines, we should be using[[https://xtdb.com/docs/][ XT's REST API]].
XT has a very rich HTTP API that covers most of its functionality /(although some of it is only available by Clojure/Java client)/.

** API formats
XT supports multiple formats: /application/edn, application/json and application/transit+json/.

As XT is written in Clojure and it natively supports Clojure's data types, we were not satisfied with available JSON types and decided to give [[https://github.com/edn-format/edn][EDN]] a try - that way we would have way more supported types:
- symbols, e.g. Elixir atoms
- decimals
- dates and timestamps

However, we had some issues with encoding Elixir/BEAM VM terms to EDN and, in general, the performance of the format - so the [[https://github.com/cognitect/transit-format][Transit/JSON]] would be an improvement as apart from being compatible with regular JSON and essentially more performant it also has a more precise types conversion.

** Main endpoints
- _GET /_xtdb/status_ - can be used as a health check for an XT node
- _GET /_xtdb/entity_ - gets a single entity from the database
- _GET /_xtdb/query_ - performs a single Datalog query
- _POST /_xtdb/submit-tx_ - submits database transactions
- _GET /_xtdb/await-tx_ - waits until the transaction was indexed on the node
- _GET /_xtdb/tx-committed/ - checks if the transaction was successfully committed
* Elixir HTTP client
As at that point in time when we started applying XT at MarleySpoon there were no Elixir libraries fully supporting XT's REST API and covering our needs so we've started writing our own HTTP adapter.

*** Umbrella application
As OMS was the only project where we were trying XTDB, we've decided to move all the Clojure code, as well as the new Elixir HTTP into the same umbrella app:

#+begin_src shell
apps/
  ...
  xtdb/
#+end_src

That way we could also easily start an XTDB node right in our project and use it from the Elixir application, e.g. by starting through docker-compose.

*** HTTP2
XT's REST API supports the second revision of HTTP format out of the box - which means that we can have a stable and more performant connection between XT clients (application servers) and the database instances.

When running an XTDB cluster in production, HTTP2 can be particularly useful. By using HTTP2, direct connections can be established between the client application and an XTDB node, rather than relying on load balancing across multiple instances. Since XTDB doesn't enforce an equal state between nodes, the same request could yield different results on different nodes - but using HTTP2 eliminates the issue and ensures consistent results for each request.

However, not every Elixir's HTTP client supports sending requests using HTTP2 - so we have to search for another option rather than using HTTPoison that we widely use in other projects.
We've decided to go with [[https://github.com/sneako/finch][Finch]], as apart from supporting HTTP2 it also focuses on performance and provides telemetry support out of the box - which we've found very useful for tracing and debugging purposes.

Using HTTP2 with Finch requires some initial configuration as we have to have just one connection in a connection pool:

#+begin_src elixir
# apps/xtdb/lib/application.ex
children = [
      {
        Finch,
        name: Xtdb.ConnectionPool,
        pools: %{
          default: [count: 1, protocol: :http2, size: 1]
        }
      }
    ]

Supervisor.start_link(children, strategy: :one_for_one, name: Xtdb.Supervisor)
#+end_src

