blog/2023-02-12-taming-the-time:-how-we've-used-xtdb.html

<div id="outline-container-org33712ca" class="outline-3">
<h3 id="org33712ca"><span class="section-number-3">4.1.</span> Connecting from REPL</h3>
<div class="outline-text-3" id="text-4-1">
<p>
To run XT in REPL we can instead just execute <span class="underline">clj</span> in shell, given that we are in the root directory of the Clojure project.
</p>

<p>
That will start a new Clojure REPL, and if we want to start XT from there, it&rsquo;s sufficient to use functions we&rsquo;ve implemented beforehand:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8959a8;">(</span><span style="color: #8959a8;">in-ns</span> 'xtdb.core<span style="color: #8959a8;">)</span> <span style="color: #8e908c;">; switches current namespace to XT wrapper's core namespace</span>
<span style="color: #8959a8;">(</span>-main<span style="color: #8959a8;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org457f711" class="outline-3">
<h3 id="org457f711"><span class="section-number-3">4.2.</span> Connecting to a remote node</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Another important benefit of XT that we unfortunately didn&rsquo;t explore enough is that by using the <span class="underline">http-client</span> dependency, we&rsquo;re able to connect to any remote node that is accessible to us by HTTP:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8959a8;">(</span><span style="color: #8959a8;">def</span> <span style="color: #c82829;">remote-node</span> <span style="color: #4271ae;">(</span><span style="color: #bb9200;">xt</span>/new-api-client remote-url<span style="color: #4271ae;">)</span><span style="color: #8959a8;">)</span>
<span style="color: #8959a8;">(</span><span style="color: #bb9200;">xt</span>/submit-tx remote-node <span style="color: #4271ae;">[</span><span style="color: #718c00;">[</span><span style="color: #f5871f;">::</span><span style="color: #bb9200;">xt</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">put</span> <span style="color: #c678dd;">{</span><span style="color: #f5871f;">:</span><span style="color: #bb9200;">xt</span><span style="color: #4d4d4c; background-color: #f2f2f2;">/</span><span style="color: #f5871f;">id</span> <span style="color: #f5871f;">:foo</span> <span style="color: #f5871f;">:bar</span> <span style="color: #f5871f;">:bar</span><span style="color: #c678dd;">}</span><span style="color: #718c00;">]</span><span style="color: #4271ae;">]</span><span style="color: #8959a8;">)</span> <span style="color: #8e908c;">; submits a transaction on the remote node</span>
</pre>
</div>

<p>
Thus, we can connect from REPL to any production XT instance and run queries / submit transactions there.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc915c05" class="outline-2">
<h2 id="orgc915c05"><span class="section-number-2">5.</span> REST API</h2>
<div class="outline-text-2" id="text-5">
<p>
XT is very convenient to use from any Clojure or JVM-based application, however, for clients implemented in other programming languages or different virtual machines, we should be using<a href="https://xtdb.com/docs/"> XT&rsquo;s REST API</a>.
XT has a very rich HTTP API that covers most of its functionality <i>(although some of it is only available by Clojure/Java client)</i>.
</p>
</div>

<div id="outline-container-orgf73d054" class="outline-3">
<h3 id="orgf73d054"><span class="section-number-3">5.1.</span> API formats</h3>
<div class="outline-text-3" id="text-5-1">
<p>
XT supports multiple formats: <i>application/edn, application/json and application/transit+json</i>.
</p>

<p>
As XT is written in Clojure and it natively supports Clojure&rsquo;s data types, we were not satisfied with available JSON types and decided to give <a href="https://github.com/edn-format/edn">EDN</a> a try - that way we would have way more supported types:
</p>
<ul class="org-ul">
<li>symbols, e.g. Elixir atoms</li>
<li>decimals</li>
<li>dates and timestamps</li>
</ul>

<p>
However, we had some issues with encoding Elixir/BEAM VM terms to EDN and, in general, the performance of the format - so the <a href="https://github.com/cognitect/transit-format">Transit/JSON</a> would be an improvement as apart from being compatible with regular JSON and essentially more performant it also has a more precise types conversion.
</p>
</div>
</div>

<div id="outline-container-orgdf8f440" class="outline-3">
<h3 id="orgdf8f440"><span class="section-number-3">5.2.</span> Main endpoints</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li><span class="underline">GET /<sub>xtdb</sub>/status</span> - can be used as a health check for an XT node</li>
<li><span class="underline">GET /<sub>xtdb</sub>/entity</span> - gets a single entity from the database</li>
<li><span class="underline">GET /<sub>xtdb</sub>/query</span> - performs a single Datalog query</li>
<li><span class="underline">POST /<sub>xtdb</sub>/submit-tx</span> - submits database transactions</li>
<li><span class="underline">GET /<sub>xtdb</sub>/await-tx</span> - waits until the transaction was indexed on the node</li>
<li><span class="underline">GET /<sub>xtdb</sub>/tx-committed</span>  - checks if the transaction was successfully committed</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org97b0674" class="outline-2">
<h2 id="org97b0674"><span class="section-number-2">6.</span> Elixir HTTP client</h2>
<div class="outline-text-2" id="text-6">
<p>
As at that point in time when we started applying XT at MarleySpoon there were no Elixir libraries fully supporting XT&rsquo;s REST API and covering our needs so we&rsquo;ve started writing our own HTTP adapter.
</p>
</div>

<div id="outline-container-org82530aa" class="outline-4">
<h4 id="org82530aa"><span class="section-number-4">6.0.1.</span> Umbrella application</h4>
<div class="outline-text-4" id="text-6-0-1">
<p>
As OMS was the only project where we were trying XTDB, we&rsquo;ve decided to move all the Clojure code, as well as the new Elixir HTTP into the same umbrella app:
</p>

<div class="org-src-container">
<pre class="src src-shell">apps/
  ...
  xtdb/
</pre>
</div>

<p>
That way we could also easily start an XTDB node right in our project and use it from the Elixir application, e.g. by starting through docker-compose.
</p>
</div>
</div>

<div id="outline-container-orgfdc815a" class="outline-4">
<h4 id="orgfdc815a"><span class="section-number-4">6.0.2.</span> HTTP2</h4>
<div class="outline-text-4" id="text-6-0-2">
<p>
XT&rsquo;s REST API supports the second revision of HTTP format out of the box - which means that we can have a stable and more performant connection between XT clients (application servers) and the database instances.
</p>

<p>
When running an XTDB cluster in production, HTTP2 can be particularly useful. By using HTTP2, direct connections can be established between the client application and an XTDB node, rather than relying on load balancing across multiple instances. Since XTDB doesn&rsquo;t enforce an equal state between nodes, the same request could yield different results on different nodes - but using HTTP2 eliminates the issue and ensures consistent results for each request.
</p>

<p>
However, not every Elixir&rsquo;s HTTP client supports sending requests using HTTP2 - so we have to search for another option rather than using HTTPoison that we widely use in other projects.
We&rsquo;ve decided to go with <a href="https://github.com/sneako/finch">Finch</a>, as apart from supporting HTTP2 it also focuses on performance and provides telemetry support out of the box - which we&rsquo;ve found very useful for tracing and debugging purposes.
</p>

<p>
Using HTTP2 with Finch requires some initial configuration as we have to have just one connection in a connection pool:
</p>

<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #8e908c;"># apps/xtdb/lib/application.ex</span>
<span style="color: #c82829;">children</span> <span style="color: #8959a8;">=</span> <span style="color: #4d4d4c; background-color: #ffffff;">[</span>
      <span style="color: #4d4d4c; background-color: #ffffff;">{</span>
        <span style="color: #bb9200;">Finch</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
        <span style="color: #f5871f;">name: </span><span style="color: #bb9200;">Xtdb.ConnectionPool</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
        <span style="color: #f5871f;">pools: </span><span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{</span>
          <span style="color: #f5871f;">default: </span><span style="color: #4d4d4c; background-color: #ffffff;">[</span><span style="color: #f5871f;">count: </span><span style="color: #f5871f;">1</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">protocol: :http2</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">size: </span><span style="color: #f5871f;">1</span><span style="color: #4d4d4c; background-color: #ffffff;">]</span>
        <span style="color: #4d4d4c; background-color: #ffffff;">}</span>
      <span style="color: #4d4d4c; background-color: #ffffff;">}</span>
    <span style="color: #4d4d4c; background-color: #ffffff;">]</span>

<span style="color: #bb9200;">Supervisor</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">start_link</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span><span style="color: #c82829;">children</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">strategy: :one_for_one</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">name: </span><span style="color: #bb9200;">Xtdb.Supervisor</span><span style="color: #4d4d4c; background-color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
