posts/2023-02-12-taming-the-time:-how-we've-used-xtdb.org
*** Telemetry & OpenTelemetry
As was mentioned in a previous section, using Finch as an HTTP Client library is a great step to have a seamless telemetry integration.

Finch provides the next Telemetry events:
- request start/stop
- request exception
- queue start/stop/exception
- connection start/stop/exception

and others, but for our purpose, we will be more interested only in the first two events.

In order to integrate the XTDB client with OpenTelemetry we wrote a simple module that watches Finch's telemetry events and pushes them to the OpenTelemetry collector:
#+begin_src elixir
# Checking for optional opentelemetry dependency
case Code.ensure_compiled(OpenTelemetry) do
  {:module, _} ->
    defmodule Xtdb.OpenTelemetry do
      @tracer_id __MODULE__

      @spec setup :: :ok
      def setup do
        attach_http_request_start()
        attach_http_request_stop()

        :ok
      end

      defp attach_http_request_start() do
        :telemetry.attach(
          {__MODULE__, :http_request_start},
          [@http_client, :send, :start],
          &__MODULE__.handle_http_request_start/4,
          %{}
        )
      end

      defp attach_http_request_stop() do
        :telemetry.attach(
          {__MODULE__, :http_request_stop},
          [@http_client, :request, :stop],
          &__MODULE__.handle_http_request_stop/4,
          %{}
        )
      end

      def handle_http_request_start(
            _event,
            _measurements,
            %{request: request},
            _config
          ) do
        ...
        Otel.start_telemetry_span(@tracer_id, "XT #{request_url}", %{}, %{
          kind: :internal,
          attributes: attributes
        })
      end

      def handle_http_request_stop(
            _event,
            _measurements,
            %{request: _request, name: ConnectionPool, result: {_, %{status: status} = result}},
            _config
          ) do
        context = Otel.set_current_telemetry_span(@tracer_id, %{})
        Span.set_attribute(context, :"http.status", status)
        ...
        OpenTelemetry.end_telemetry_span(@tracer_id, %{})
      end
    end

  _ ->
    nil
end
#+end_src

