blog/2023-02-12-taming-the-time:-how-we've-used-xtdb.html

<div id="outline-container-orgde9ab45" class="outline-4">
<h4 id="orgde9ab45"><span class="section-number-4">6.0.3.</span> Telemetry &amp; OpenTelemetry</h4>
<div class="outline-text-4" id="text-6-0-3">
<p>
As was mentioned in a previous section, using Finch as an HTTP Client library is a great step to have a seamless telemetry integration.
</p>

<p>
Finch provides the next Telemetry events:
</p>
<ul class="org-ul">
<li>request start/stop</li>
<li>request exception</li>
<li>queue start/stop/exception</li>
<li>connection start/stop/exception</li>
</ul>

<p>
and others, but for our purpose, we will be more interested only in the first two events.
</p>

<p>
In order to integrate the XTDB client with OpenTelemetry we wrote a simple module that watches Finch&rsquo;s telemetry events and pushes them to the OpenTelemetry collector:
</p>
<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #8e908c;"># Checking for optional opentelemetry dependency</span>
<span style="color: #8959a8; font-weight: bold;">case</span> <span style="color: #bb9200;">Code</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">ensure_compiled</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span><span style="color: #bb9200;">OpenTelemetry</span><span style="color: #4d4d4c; background-color: #ffffff;">)</span> <span style="color: #8959a8;">do</span>
  <span style="color: #4d4d4c; background-color: #ffffff;">{</span><span style="color: #f5871f;">:module</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #8e908c;">_</span><span style="color: #4d4d4c; background-color: #ffffff;">}</span> <span style="color: #8959a8;">-&gt;</span>
    <span style="color: #8959a8; font-weight: bold;">defmodule</span> <span style="color: #bb9200;">Xtdb.OpenTelemetry</span> <span style="color: #8959a8;">do</span>
      <span style="color: #4d4d4c; font-weight: bold;">@</span><span style="color: #4d4d4c; font-weight: bold;">tracer_id</span> <span style="color: #4271ae;">__MODULE__</span>

      <span style="color: #4d4d4c; font-weight: bold;">@</span><span style="color: #4d4d4c; font-weight: bold;">spec</span> <span style="color: #c82829;">setup</span> <span style="color: #8959a8;">::</span> <span style="color: #f5871f;">:ok</span>
      <span style="color: #8959a8; font-weight: bold;">def</span> <span style="color: #c82829;">setup</span> <span style="color: #8959a8;">do</span>
        <span style="color: #4271ae; font-weight: bold;">attach_http_request_start</span><span style="color: #4d4d4c; background-color: #ffffff;">()</span>
        <span style="color: #4271ae; font-weight: bold;">attach_http_request_stop</span><span style="color: #4d4d4c; background-color: #ffffff;">()</span>

        <span style="color: #f5871f;">:ok</span>
      <span style="color: #8959a8;">end</span>

      <span style="color: #8959a8; font-weight: bold;">defp</span> <span style="color: #4271ae; font-weight: bold;">attach_http_request_start</span><span style="color: #4d4d4c; background-color: #ffffff;">()</span> <span style="color: #8959a8;">do</span>
        <span style="color: #bb9200;">:telemetry</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">attach</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span>
          <span style="color: #4d4d4c; background-color: #ffffff;">{</span><span style="color: #4271ae;">__MODULE__</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">:http_request_start</span><span style="color: #4d4d4c; background-color: #ffffff;">}</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
          <span style="color: #4d4d4c; background-color: #ffffff;">[</span><span style="color: #4d4d4c; font-weight: bold;">@</span><span style="color: #4d4d4c; font-weight: bold;">http_client</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">:send</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">:start</span><span style="color: #4d4d4c; background-color: #ffffff;">]</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
          <span style="color: #8959a8;">&amp;</span><span style="color: #4271ae;">__MODULE__</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">handle_http_request_start</span><span style="color: #8959a8;">/</span><span style="color: #f5871f;">4</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
          <span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{}</span>
        <span style="color: #4d4d4c; background-color: #ffffff;">)</span>
      <span style="color: #8959a8;">end</span>

      <span style="color: #8959a8; font-weight: bold;">defp</span> <span style="color: #4271ae; font-weight: bold;">attach_http_request_stop</span><span style="color: #4d4d4c; background-color: #ffffff;">()</span> <span style="color: #8959a8;">do</span>
        <span style="color: #bb9200;">:telemetry</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">attach</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span>
          <span style="color: #4d4d4c; background-color: #ffffff;">{</span><span style="color: #4271ae;">__MODULE__</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">:http_request_stop</span><span style="color: #4d4d4c; background-color: #ffffff;">}</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
          <span style="color: #4d4d4c; background-color: #ffffff;">[</span><span style="color: #4d4d4c; font-weight: bold;">@</span><span style="color: #4d4d4c; font-weight: bold;">http_client</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">:request</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">:stop</span><span style="color: #4d4d4c; background-color: #ffffff;">]</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
          <span style="color: #8959a8;">&amp;</span><span style="color: #4271ae;">__MODULE__</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">handle_http_request_stop</span><span style="color: #8959a8;">/</span><span style="color: #f5871f;">4</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
          <span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{}</span>
        <span style="color: #4d4d4c; background-color: #ffffff;">)</span>
      <span style="color: #8959a8;">end</span>

      <span style="color: #8959a8; font-weight: bold;">def</span> <span style="color: #4271ae; font-weight: bold;">handle_http_request_start</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span>
            <span style="color: #8e908c;">_event</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
            <span style="color: #8e908c;">_measurements</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
            <span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{</span><span style="color: #f5871f;">request: </span><span style="color: #c82829;">request</span><span style="color: #4d4d4c; background-color: #ffffff;">}</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
            <span style="color: #8e908c;">_config</span>
          <span style="color: #4d4d4c; background-color: #ffffff;">)</span> <span style="color: #8959a8;">do</span>
        <span style="color: #c82829;">...</span>
        <span style="color: #bb9200;">Otel</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">start_telemetry_span</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span><span style="color: #4d4d4c; font-weight: bold;">@</span><span style="color: #4d4d4c; font-weight: bold;">tracer_id</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #718c00;">"XT </span><span style="color: #8959a8;">#{</span><span style="color: #4d4d4c; background-color: #ffffff;">request_url</span><span style="color: #8959a8; background-color: #ffffff;">}</span><span style="color: #718c00;">"</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{}</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{</span>
          <span style="color: #f5871f;">kind: :internal</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
          <span style="color: #f5871f;">attributes: </span><span style="color: #c82829;">attributes</span>
        <span style="color: #4d4d4c; background-color: #ffffff;">})</span>
      <span style="color: #8959a8;">end</span>

      <span style="color: #8959a8; font-weight: bold;">def</span> <span style="color: #4271ae; font-weight: bold;">handle_http_request_stop</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span>
            <span style="color: #8e908c;">_event</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
            <span style="color: #8e908c;">_measurements</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
            <span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{</span><span style="color: #f5871f;">request: </span><span style="color: #8e908c;">_request</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">name: </span><span style="color: #bb9200;">ConnectionPool</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">result: </span><span style="color: #4d4d4c; background-color: #ffffff;">{</span><span style="color: #8e908c;">_</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{</span><span style="color: #f5871f;">status: </span><span style="color: #c82829;">status</span><span style="color: #4d4d4c; background-color: #ffffff;">}</span> <span style="color: #8959a8;">=</span> <span style="color: #c82829;">result</span><span style="color: #4d4d4c; background-color: #ffffff;">}}</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span>
            <span style="color: #8e908c;">_config</span>
          <span style="color: #4d4d4c; background-color: #ffffff;">)</span> <span style="color: #8959a8;">do</span>
        <span style="color: #c82829;">context</span> <span style="color: #8959a8;">=</span> <span style="color: #bb9200;">Otel</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">set_current_telemetry_span</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span><span style="color: #4d4d4c; font-weight: bold;">@</span><span style="color: #4d4d4c; font-weight: bold;">tracer_id</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{})</span>
        <span style="color: #bb9200;">Span</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">set_attribute</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span><span style="color: #c82829;">context</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">:"http.status"</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #c82829;">status</span><span style="color: #4d4d4c; background-color: #ffffff;">)</span>
        <span style="color: #c82829;">...</span>
        <span style="color: #bb9200;">OpenTelemetry</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">end_telemetry_span</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span><span style="color: #4d4d4c; font-weight: bold;">@</span><span style="color: #4d4d4c; font-weight: bold;">tracer_id</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #4d4d4c; background-color: #ffffff;">%</span><span style="color: #4d4d4c; background-color: #ffffff;">{})</span>
      <span style="color: #8959a8;">end</span>
    <span style="color: #8959a8;">end</span>

  <span style="color: #8e908c;">_</span> <span style="color: #8959a8;">-&gt;</span>
    <span style="color: #f5871f;">nil</span>
<span style="color: #8959a8;">end</span>
</pre>
</div>
</div>
</div>
