posts/2023-02-12-taming-the-time:-how-we've-used-xtdb.org
*** Encoding EDN

In Elixir are using [[https://github.com/jfacorro/Eden][Eden]] library in order to decode and encode data from and to EDN format. In most cases it works without any issues, however, for decimals we had to implement protocol support for Elixir /Decimal/ type:

#+begin_src elixir
# Implements Eden.Encode protocol for Decimal structs
defimpl Eden.Encode, for: Decimal do
  # Adds a decimal digit number so it can be picked by EDN
  @spec encode(Decimal.t()) :: String.t()
  def encode(decimal), do: decimal |> Decimal.to_string() |> Kernel.<>("M")
end
#+end_src

That way you can also implement support of any other custom type or struct that you might need to persist in XT.

* Testing XTDB
Because XTDB is an immutable database, it's not so simple to delete data from it. This can have implications when it comes to testing, as traditional methods of clearing and resetting a database may not be effective. To integrate XT into a test suite, the most straightforward approach is to run an in-memory node alongside the suite. This allows for more granular control over data, as the in-memory node can be reset or recreated as needed.

We've achieved that by using the in-memory XTDB Docker image in our docker-compose setup:

#+begin_src yaml
  # Wait for Docker container to be ready
  wait:
    image: dokku/wait

  xtdb_test:
    image: juxt/xtdb-in-memory:1.21.0
    ports:
      - 3000:3000
#+end_src

and also created a simple shell script that we use in order to run the integration test suite:

#+begin_src shell
docker-compose up --remove-orphans -d xtdb_test
docker-compose run wait -c xtdb_test:3000
docker-compose run mix_test
docker-compose stop xtdb_test mix_test
#+end_src

In the case of unit tests, as any request coming through the XTDB client is basically an HTTP request, we could also use VCR cassettes as mocks in order to avoid sending real requests to the test instances.

* What's next?
In this article, we've discussed how XTDB can be used alongside applications written in Elixir and demonstrated how to implement a simple HTTP client for working with the database. We also covered how to develop and test applications using XTDB, and the importance of running an in-memory node for testing purposes.

In the third and final part of this series, we'll be sharing how we used Docker and docker-compose to set up a local development environment for XTDB, as well as how we deployed and ran it in production. We'll also be discussing caveats and issues we encountered, and how we addressed them.

We can also recommend some more reading on the topic if you're interested in developing with XTDB:

- https://xtdb.com/docs/
- https://xtdb.com/blog/xtdb-command-line/

Happy Hacking and stay tuned!
