blog/2023-02-12-taming-the-time:-how-we've-used-xtdb.html

<div id="outline-container-orgf455515" class="outline-4">
<h4 id="orgf455515"><span class="section-number-4">6.0.4.</span> Encoding EDN</h4>
<div class="outline-text-4" id="text-6-0-4">
<p>
In Elixir are using <a href="https://github.com/jfacorro/Eden">Eden</a> library in order to decode and encode data from and to EDN format. In most cases it works without any issues, however, for decimals we had to implement protocol support for Elixir <i>Decimal</i> type:
</p>

<div class="org-src-container">
<pre class="src src-elixir"><span style="color: #8e908c;"># Implements Eden.Encode protocol for Decimal structs</span>
<span style="color: #8959a8; font-weight: bold;">defimpl</span> <span style="color: #bb9200;">Eden.Encode</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">for: </span><span style="color: #bb9200;">Decimal</span> <span style="color: #8959a8;">do</span>
  <span style="color: #8e908c;"># Adds a decimal digit number so it can be picked by EDN</span>
  <span style="color: #4d4d4c; font-weight: bold;">@</span><span style="color: #4d4d4c; font-weight: bold;">spec</span> <span style="color: #4271ae; font-weight: bold;">encode</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span><span style="color: #bb9200;">Decimal</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">t</span><span style="color: #4d4d4c; background-color: #ffffff;">())</span> <span style="color: #8959a8;">::</span> <span style="color: #bb9200;">String</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">t</span><span style="color: #4d4d4c; background-color: #ffffff;">()</span>
  <span style="color: #8959a8; font-weight: bold;">def</span> <span style="color: #4271ae; font-weight: bold;">encode</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span><span style="color: #c82829;">decimal</span><span style="color: #4d4d4c; background-color: #ffffff;">)</span><span style="color: #4d4d4c; background-color: #ffffff;">,</span> <span style="color: #f5871f;">do: </span><span style="color: #c82829;">decimal</span> <span style="color: #8959a8;">|&gt;</span> <span style="color: #bb9200;">Decimal</span><span style="color: #8959a8;">.</span><span style="color: #4271ae; font-weight: bold;">to_string</span><span style="color: #4d4d4c; background-color: #ffffff;">()</span> <span style="color: #8959a8;">|&gt;</span> <span style="color: #bb9200;">Kernel</span><span style="color: #8959a8;">.&lt;&gt;</span><span style="color: #4d4d4c; background-color: #ffffff;">(</span><span style="color: #718c00;">"M"</span><span style="color: #4d4d4c; background-color: #ffffff;">)</span>
<span style="color: #8959a8;">end</span>
</pre>
</div>

<p>
That way you can also implement support of any other custom type or struct that you might need to persist in XT.
</p>
</div>
</div>
</div>

<div id="outline-container-org15ec514" class="outline-2">
<h2 id="org15ec514"><span class="section-number-2">7.</span> Testing XTDB</h2>
<div class="outline-text-2" id="text-7">
<p>
Because XTDB is an immutable database, it&rsquo;s not so simple to delete data from it. This can have implications when it comes to testing, as traditional methods of clearing and resetting a database may not be effective. To integrate XT into a test suite, the most straightforward approach is to run an in-memory node alongside the suite. This allows for more granular control over data, as the in-memory node can be reset or recreated as needed.
</p>

<p>
We&rsquo;ve achieved that by using the in-memory XTDB Docker image in our docker-compose setup:
</p>

<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #8e908c;"># </span><span style="color: #8e908c;">Wait for Docker container to be ready</span>
  <span style="color: #c82829;">wait</span>:
    <span style="color: #c82829;">image</span>: dokku/wait

  <span style="color: #c82829;">xtdb_test</span>:
    <span style="color: #c82829;">image</span>: juxt/xtdb-in-memory:1.21.0
    <span style="color: #c82829;">ports</span>:
      - 3000:3000
</pre>
</div>

<p>
and also created a simple shell script that we use in order to run the integration test suite:
</p>

<div class="org-src-container">
<pre class="src src-shell">docker-compose up --remove-orphans -d xtdb_test
docker-compose run wait -c xtdb_test:3000
docker-compose run mix_test
docker-compose stop xtdb_test mix_test
</pre>
</div>

<p>
In the case of unit tests, as any request coming through the XTDB client is basically an HTTP request, we could also use VCR cassettes as mocks in order to avoid sending real requests to the test instances.
</p>
</div>
</div>

<div id="outline-container-orga239462" class="outline-2">
<h2 id="orga239462"><span class="section-number-2">8.</span> What&rsquo;s next?</h2>
<div class="outline-text-2" id="text-8">
<p>
In this article, we&rsquo;ve discussed how XTDB can be used alongside applications written in Elixir and demonstrated how to implement a simple HTTP client for working with the database. We also covered how to develop and test applications using XTDB, and the importance of running an in-memory node for testing purposes.
</p>

<p>
In the third and final part of this series, we&rsquo;ll be sharing how we used Docker and docker-compose to set up a local development environment for XTDB, as well as how we deployed and ran it in production. We&rsquo;ll also be discussing caveats and issues we encountered, and how we addressed them.
</p>

<p>
We can also recommend some more reading on the topic if you&rsquo;re interested in developing with XTDB:
</p>

<ul class="org-ul">
<li><a href="https://xtdb.com/docs/">https://xtdb.com/docs/</a></li>
<li><a href="https://xtdb.com/blog/xtdb-command-line/">https://xtdb.com/blog/xtdb-command-line/</a></li>
</ul>

<p>
Happy Hacking and stay tuned!
</p>
</div>
</div>
<div class="taglist"><a href="https://neiro.io/tags.html">Tags</a>: <a href="https://neiro.io/tag-bitemporality.html">bitemporality</a> <a href="https://neiro.io/tag-databases.html">databases</a> <a href="https://neiro.io/tag-elixir.html">elixir</a> <a href="https://neiro.io/tag-xtdb.html">xtdb</a> <a href="https://neiro.io/tag-clojure.html">clojure</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
